## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:89" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:89" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:a3889fb8c7e1bc75713855f5e88617c0dc3337069efed37b6317a87be0f534cb" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:6ef43e4de6cd8e79c228c096f645e5333f7cda98ba8c69b28fedb62a93893164"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 89 -> (known after apply)
-       tags                     = {} -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-graphql" {
      ~ etag                   = "0603923bf51900b3ccf4f930b3d340f0-6" -> "938984eea36f7f37854f599588f82097"
        id                     = "graphql.938984eea36f7f37854f599588f82097.zip"
        tags                   = {}
      ~ version_id             = "UkpGaru1AkCd3BQIIEKhW8S5zPvvp3jg" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-processValidationJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-processValidationJson" {
      ~ etag                   = "c31b368cf036d6e1e9bb0543d2d9a8aa-5" -> "b8273fdb4bc8f0ae6540ab69af44ff94"
        id                     = "processValidationJson.b8273fdb4bc8f0ae6540ab69af44ff94.zip"
        tags                   = {}
      ~ version_id             = "iTXzYylR8ktUm8kST4J291Tv0yXVsxN2" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-python must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-python" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/python.bd1e13b41a6c95a331766a8cd85ae632.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "482ec9ff128b2079c6da9601dcdf057b-4" -> "bac8b156ebb08585aad91b30fc9fed4d"
      ~ id                     = "python.bd1e13b41a6c95a331766a8cd85ae632.zip" -> (known after apply)
      ~ key                    = "python.bd1e13b41a6c95a331766a8cd85ae632.zip" -> "python.bac8b156ebb08585aad91b30fc9fed4d.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "bd1e13b41a6c95a331766a8cd85ae632" -> "bac8b156ebb08585aad91b30fc9fed4d"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "bZVuZWg79EW4e702wjIUXckxr2PQ8F1W" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "57ecc08f530f79688db80c5042c9aada" -> "1cf16508231f3d1824c9fd780b180ef5"
        id                     = "dist/200.html"
      ~ source_hash            = "57ecc08f530f79688db80c5042c9aada" -> "1cf16508231f3d1824c9fd780b180ef5"
        tags                   = {}
      ~ version_id             = "mwfuCl5MfSISXYe6G6S.u9_90snMfFl8" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "58a2c2acc81155c45da70929f73731e2" -> "5021ed02706427f2840d0ea85502a789"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "58a2c2acc81155c45da70929f73731e2" -> "5021ed02706427f2840d0ea85502a789"
        tags                   = {}
      ~ version_id             = "sMyJBGMVeAKNrlAbUzEWxuFSSclRoxnV" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "81647d4d2e76adc797a7e1471e2cf03f" -> "650645de52017afc0e22e76db7d760c4"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "81647d4d2e76adc797a7e1471e2cf03f" -> "650645de52017afc0e22e76db7d760c4"
        tags                   = {}
      ~ version_id             = "h4WRH52YjChhoPRSq5Obooj3x6cnpq0e" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "57ecc08f530f79688db80c5042c9aada" -> "1cf16508231f3d1824c9fd780b180ef5"
        id                     = "dist/index.html"
      ~ source_hash            = "57ecc08f530f79688db80c5042c9aada" -> "1cf16508231f3d1824c9fd780b180ef5"
        tags                   = {}
      ~ version_id             = "Pnz7akFiURH6wYPLReHthsyqv01RMT56" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.20ad7183.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "cbe21e685ada3914355be4b695f19430"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.20ad7183.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.20ad7183.js"
+       source_hash            = "cbe21e685ada3914355be4b695f19430"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.20ad7183.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "b703266ba347d460c07ac79899e011fa"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.20ad7183.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.20ad7183.js.LICENSE.txt"
+       source_hash            = "b703266ba347d460c07ac79899e011fa"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.a810bffa.js"] will be destroyed
  # (because key ["static/js/app.a810bffa.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.a810bffa.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "bb194f6592a6e84ea934031fdb2d9994" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.a810bffa.js" -> null
-       key                    = "dist/static/js/app.a810bffa.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.a810bffa.js" -> null
-       source_hash            = "bb194f6592a6e84ea934031fdb2d9994" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "YlSJ4T.t1WyX6fVmbLOGxBgO9b79sFhr" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.a810bffa.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.a810bffa.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.a810bffa.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "b703266ba347d460c07ac79899e011fa" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.a810bffa.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.a810bffa.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.a810bffa.js.LICENSE.txt" -> null
-       source_hash            = "b703266ba347d460c07ac79899e011fa" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "Rn_XccCFL56LNoZSbAxCIFFxAmgQxeSF" -> null
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ last_modified                  = "2024-04-12T02:19:59.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:56" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:56/invocations" -> (known after apply)
      ~ s3_key                         = "python.bd1e13b41a6c95a331766a8cd85ae632.zip" -> "python.bac8b156ebb08585aad91b30fc9fed4d.zip"
        tags                           = {}
      ~ version                        = "56" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "994d1a37c5631479526c56b33eb3680308957658" -> "22e0d6bb418cff4157a0a57c5c1fae600f154c2f"
              ~ "DD_TAGS"                      = "git.commit.sha:994d1a37c5631479526c56b33eb3680308957658,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:22e0d6bb418cff4157a0a57c5c1fae600f154c2f,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "994d1a37c5631479526c56b33eb3680308957658" -> "22e0d6bb418cff4157a0a57c5c1fae600f154c2f"
                # (14 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "56" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:104" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:104/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "104" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "994d1a37c5631479526c56b33eb3680308957658" -> "22e0d6bb418cff4157a0a57c5c1fae600f154c2f"
              ~ "DD_TAGS"                            = "git.commit.sha:994d1a37c5631479526c56b33eb3680308957658,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:22e0d6bb418cff4157a0a57c5c1fae600f154c2f,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "994d1a37c5631479526c56b33eb3680308957658" -> "22e0d6bb418cff4157a0a57c5c1fae600f154c2f"
                # (17 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "104" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-processValidationJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:12" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:12/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "12" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "994d1a37c5631479526c56b33eb3680308957658" -> "22e0d6bb418cff4157a0a57c5c1fae600f154c2f"
              ~ "DD_TAGS"                      = "git.commit.sha:994d1a37c5631479526c56b33eb3680308957658,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:22e0d6bb418cff4157a0a57c5c1fae600f154c2f,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "994d1a37c5631479526c56b33eb3680308957658" -> "22e0d6bb418cff4157a0a57c5c1fae600f154c2f"
                # (13 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "12" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 7 to add, 10 to change, 7 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8667190808)*